#include "StdAfx.h"
#include "BulletObject.h"

/*-------------------------------------------
	コンストラクタ
--------------------------------------------*/
BulletObject::BulletObject(const long x, const long y, const float dir)
:bulletDir(dir)
{
	posX = x;
	posY = y;
}

/*-------------------------------------------
	デストラクタ
--------------------------------------------*/
BulletObject::~BulletObject()
{
}

/*-------------------------------------------
	初期化
--------------------------------------------*/
void BulletObject::Init()
{
}

/*-------------------------------------------
	動作
--------------------------------------------*/
void BulletObject::Move()
{
}

/*-------------------------------------------
	描画
--------------------------------------------*/
void BulletObject::Draw()
{
}
